Ran Plan for dir: `02_k8s/02_infra` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # local_file.inventory_kubespray will be created
+ resource "local_file" "inventory_kubespray" {
      + content              = <<-EOT
            [all]
            master-node-1 ansible_host=158.160.49.136 ip=10.0.1.14
            worker-node-1 ansible_host=158.160.6.237 ip=10.0.2.22
            worker-node-2 ansible_host=158.160.201.189 ip=10.0.3.9
            
            [kube_control_plane]
            master-node-1
            
            [etcd]
            master-node-1
            
            [kube_node]
            worker-node-1
            worker-node-2
            
            [k8s_cluster:children]
            kube_control_plane
            kube_node
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "ansible/inventory/inventory.ini"
      + id                   = (known after apply)
    }

  # yandex_compute_instance.k8s["master-node-1"] will be updated in-place
~ resource "yandex_compute_instance" "k8s" {
        id                        = "fhmdrrmk951oc66qqbob"
      ~ metadata                  = {
          ~ "user-data"          = <<-EOT
                #cloud-config
                users:
                  - name: reivol
                    groups: sudo
                    shell: /bin/bash
                    sudo: ["ALL=(ALL) NOPASSWD:ALL"]
                    ssh_authorized_keys:
                      - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDOdA3hLYrpA+RUD1AEguHntlb4XeEI2KsXIXgW9FmUBBMAiXWZv+fEunnJ37zd2r1zExYRahGeeec6iuWZEtIfW4Tl3wm4DRAlLFuuDysED8UuDqpcsuqrYgUHs5oDR0jRRDUhCF2Hsdt4yKQa9e6HL/efqbhfaLW3+aLFTBB5sVOCJllEvxbVlvBtH1r5CbWyozZpzG/Fv8D3i360BpJj91Y9tEEQpxKDekca1f3EvUIBgPaI9/LlTFY0mDlEtflHBwdohA+B8kpXHh12rgNLzjntsForRbLytjGLp8R+vJ7pNPfkYE/tOItemqPJWALv+zyXwqGjPsO9yE9QmwrrSpw4tnsPLV7mUfj+Mi6bcVm5A1KoKRYWK2r3yDnPTQzrXOoZAkZW/yTCVjLfKD8YWHglugR0zeRGW3/KY9fjX+d4POv6OEOX1YrG25nhoa4nm+OCreiz8Z12Nflb9AsX1pDUeoN4LrES6BHy4gPajFztYeiW8HM+iHM9LOCXPes= reivol@Zabbix
              + 
                package_update: true
                package_upgrade: false
                packages:
                  - nano
                  - mc
            EOT
            # (1 unchanged element hidden)
        }
        name                      = "master-node-1"
        # (14 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # yandex_compute_instance.k8s["worker-node-1"] will be updated in-place
~ resource "yandex_compute_instance" "k8s" {
        id                        = "epddo5tps9il6p5i5i5c"
      ~ metadata                  = {
          ~ "user-data"          = <<-EOT
                #cloud-config
                users:
                  - name: reivol
                    groups: sudo
                    shell: /bin/bash
                    sudo: ["ALL=(ALL) NOPASSWD:ALL"]
                    ssh_authorized_keys:
                      - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDOdA3hLYrpA+RUD1AEguHntlb4XeEI2KsXIXgW9FmUBBMAiXWZv+fEunnJ37zd2r1zExYRahGeeec6iuWZEtIfW4Tl3wm4DRAlLFuuDysED8UuDqpcsuqrYgUHs5oDR0jRRDUhCF2Hsdt4yKQa9e6HL/efqbhfaLW3+aLFTBB5sVOCJllEvxbVlvBtH1r5CbWyozZpzG/Fv8D3i360BpJj91Y9tEEQpxKDekca1f3EvUIBgPaI9/LlTFY0mDlEtflHBwdohA+B8kpXHh12rgNLzjntsForRbLytjGLp8R+vJ7pNPfkYE/tOItemqPJWALv+zyXwqGjPsO9yE9QmwrrSpw4tnsPLV7mUfj+Mi6bcVm5A1KoKRYWK2r3yDnPTQzrXOoZAkZW/yTCVjLfKD8YWHglugR0zeRGW3/KY9fjX+d4POv6OEOX1YrG25nhoa4nm+OCreiz8Z12Nflb9AsX1pDUeoN4LrES6BHy4gPajFztYeiW8HM+iHM9LOCXPes= reivol@Zabbix
              + 
                package_update: true
                package_upgrade: false
                packages:
                  - nano
                  - mc
            EOT
            # (1 unchanged element hidden)
        }
        name                      = "worker-node-1"
        # (14 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # yandex_compute_instance.k8s["worker-node-2"] will be updated in-place
~ resource "yandex_compute_instance" "k8s" {
        id                        = "fv4i8ib2nlkvag8dhol8"
      ~ metadata                  = {
          ~ "user-data"          = <<-EOT
                #cloud-config
                users:
                  - name: reivol
                    groups: sudo
                    shell: /bin/bash
                    sudo: ["ALL=(ALL) NOPASSWD:ALL"]
                    ssh_authorized_keys:
                      - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDOdA3hLYrpA+RUD1AEguHntlb4XeEI2KsXIXgW9FmUBBMAiXWZv+fEunnJ37zd2r1zExYRahGeeec6iuWZEtIfW4Tl3wm4DRAlLFuuDysED8UuDqpcsuqrYgUHs5oDR0jRRDUhCF2Hsdt4yKQa9e6HL/efqbhfaLW3+aLFTBB5sVOCJllEvxbVlvBtH1r5CbWyozZpzG/Fv8D3i360BpJj91Y9tEEQpxKDekca1f3EvUIBgPaI9/LlTFY0mDlEtflHBwdohA+B8kpXHh12rgNLzjntsForRbLytjGLp8R+vJ7pNPfkYE/tOItemqPJWALv+zyXwqGjPsO9yE9QmwrrSpw4tnsPLV7mUfj+Mi6bcVm5A1KoKRYWK2r3yDnPTQzrXOoZAkZW/yTCVjLfKD8YWHglugR0zeRGW3/KY9fjX+d4POv6OEOX1YrG25nhoa4nm+OCreiz8Z12Nflb9AsX1pDUeoN4LrES6BHy4gPajFztYeiW8HM+iHM9LOCXPes= reivol@Zabbix
              + 
                package_update: true
                package_upgrade: false
                packages:
                  - nano
                  - mc
            EOT
            # (1 unchanged element hidden)
        }
        name                      = "worker-node-2"
        # (14 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # yandex_lb_network_load_balancer.grafana will be created
+ resource "yandex_lb_network_load_balancer" "grafana" {
      + allow_zonal_shift   = (known after apply)
      + created_at          = (known after apply)
      + deletion_protection = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "grafana"
      + region_id           = (known after apply)
      + type                = "external"

      + attached_target_group {
          + target_group_id = (known after apply)

          + healthcheck {
              + healthy_threshold   = 2
              + interval            = 2
              + name                = "healthcheck"
              + timeout             = 1
              + unhealthy_threshold = 2

              + tcp_options {
                  + port = 30001
                }
            }
        }

      + listener {
          + name        = "grafana-listener"
          + port        = 80
          + protocol    = (known after apply)
          + target_port = 30001

          + external_address_spec {
              + address    = (known after apply)
              + ip_version = "ipv4"
            }
        }
    }

  # yandex_lb_network_load_balancer.nginx will be created
+ resource "yandex_lb_network_load_balancer" "nginx" {
      + allow_zonal_shift   = (known after apply)
      + created_at          = (known after apply)
      + deletion_protection = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "nginx"
      + region_id           = (known after apply)
      + type                = "external"

      + attached_target_group {
          + target_group_id = (known after apply)

          + healthcheck {
              + healthy_threshold   = 2
              + interval            = 2
              + name                = "healthcheck"
              + timeout             = 1
              + unhealthy_threshold = 2

              + tcp_options {
                  + port = 30002
                }
            }
        }

      + listener {
          + name        = "nginx-listener"
          + port        = 80
          + protocol    = (known after apply)
          + target_port = 30002

          + external_address_spec {
              + address    = (known after apply)
              + ip_version = "ipv4"
            }
        }
    }

  # yandex_lb_target_group.k8s-nlb will be created
+ resource "yandex_lb_target_group" "k8s-nlb" {
      + created_at      = (known after apply)
      + description     = (known after apply)
      + folder_id       = (known after apply)
      + id              = (known after apply)
      + labels          = (known after apply)
      + name            = "k8s-balancer-group"
      + region_id       = (known after apply)
      + target_group_id = (known after apply)

      + target {
          + address   = "10.0.1.14"
          + subnet_id = "e9b3hc16i4kn814uj0fa"
        }
      + target {
          + address   = "10.0.2.22"
          + subnet_id = "e2lji8k9vm9ho7l5b34q"
        }
      + target {
          + address   = "10.0.3.9"
          + subnet_id = "fl808c49k0b1qfafe1th"
        }
    }

Plan: 4 to add, 3 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d 02_k8s/02_infra
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis-5c7f59b95d-nhgw9:4141/lock?id=vladislav-arzybov%252FDiplom_vladislav_arzybov%252F02_k8s%252F02_infra%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d 02_k8s/02_infra
  ```
Plan: 4 to add, 3 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```